Revit 2024 API
LoadBase.IsReaction Property
 The load is reaction option.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsReaction { get; set; }
Visual Basic
Public Property IsReaction As Boolean
	Get
	Set
Visual C++
public:
property bool IsReaction {
	bool get ();
	void set (bool value);
}
See Also
LoadBase Class
Autodesk.Revit.DB.Structure Namespace